app/controllers/articles_controller.rb

        def create
                @article = Article.new(params[:article])
		if @article.save
---
INSERT INTO "articles" ("created_at", "title", "updated_at", "content") VALUES('2010-10-19 21:31:05', 'jkjk', '2010-10-19 21:31:05', 'jk')

        def update
		@article = Article.find(params[:id])
		if @article.update_attributes(params[:article])
---
SELECT * FROM "articles" WHERE ("articles"."id" = 1)
UPDATE "articles" SET "updated_at" = '2010-10-19 21:48:05', "title" = 'heniek to jozek', "content" = 'no co ty nie powiesz?!