app/controllers/comments_controller.rb

	def new
		@comment = Article.find(params[:article_id]).comments.new
---
SELECT * FROM "articles" WHERE ("articles"."id" = 2)

	def create
		article = Article.find(params[:article_id])
		@comment = article.comments.new(params[:comment])
		if @comment.save
---
SELECT * FROM "articles" WHERE ("articles"."id" = 3)
INSERT INTO "comments" ("created_at", "author", "updated_at", "article_id", "content") VALUES('2010-10-19 23:38:31', 'klkl', '2010-10-19 23:38:31', 3, 'lkl')